Revit 2026 API

# ConnectorGenderType Enumeration

---

Connector gender type enum

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConnectorGenderType
```
```vb
Public Enumeration ConnectorGenderType
```
```cpp
public enum class ConnectorGenderType
```
```fsharp
type ConnectorGenderType
```

| Member name | Value | Description |
| --- | --- | --- |
| Female | 2 | Female connector gender type |
| Male | 1 | Male connector gender type |
| Undefined | 0 | Undefined connector gender type |

#### Reference

Autodesk.Revit.DB Namespace